# Представлен список чисел. Определить элементы списка, не имеющие повторений. Сформировать итоговый массив чисел, соответствующих требованию. Элементы вывести в порядке их следования в исходном списке. Для выполнения задания обязательно использовать генератор.
#Пример исходного списка: [2, 2, 2, 7, 23, 1, 44, 44, 3, 2, 10, 7, 4, 11].
#Результат: [23, 1, 3, 10, 4, 11]
input_str = input('Введите список чисел через пробел (некоторые должны повторяться): ')
repeatable = []
repeatable = input_str.split()
unrepeatable = [el for el in repeatable if repeatable.count(el) == 1]
print(f'Уникальные числа Вашей последовательности: {unrepeatable}')