#6. Реализовать два небольших скрипта:
#а) итератор, генерирующий целые числа, начиная с указанного,
#б) итератор, повторяющий элементы некоторого списка, определенного заранее.
#Подсказка: использовать функцию count() и cycle() модуля itertools.
# Обратите внимание, что создаваемый цикл не должен быть бесконечным. Необходимо предусмотреть условие его завершения.
#Например, в первом задании выводим целые числа, начиная с 3, а при достижении числа 10 завершаем цикл.
# Во втором также необходимо предусмотреть условие, при котором повторение элементов списка будет прекращено.
from itertools import count, cycle
for el in count(3):
    if el > 10:
        break
    else:
        print(el)
i = 0
new_str = ''
for el in cycle('Съешь ещё этих мягких французских булочек да выпей чаю '):
    if i > 60:
        break
    else:
        new_str = new_str + el + '-'
        i += 1
print(new_str)
