print('Иван Петровский - чемпион страны по легкой атлетике. И это не предел!' )
print('Ежедневно тренируясь, он с каждым днем преодолевает всё бОльшие расстояния,')
print('увеличивая предыдущий результат на 10% !')
dist = int(input('Сегодня он пробежал, км: '))
distfin =int(input('Заветный результат, км: '))
day = 1
while dist < distfin:
    print(f'{day}-й день: {dist}')
    dist = dist * 1.1
    dist = round(dist,2)
    day += 1
print(f'{day}-й день: {dist}')
print(f'На {day}-й день спортсмен достиг результата - не менее {distfin} км. Тренируйся и ты - обгони Ивана Петровского!')